// Напишите программу, которая работала бы следующим образом: в prompt вводится значение. С помощью унарного плюса (арифметический оператор) необходимо преобразовать его в число, затем проверить с помощью typeof, принадлежит ли оно к множеству Number.						
// Если это число, то вывести в консоль чётное оно или нечётное.						
// Если передано не число, выведите: «Упс, кажется, вы ошиблись».						
// *NaN, хоть и относится к типу Number, числом не является. Добавьте отдельную проверку для этого значения.						

const result = prompt('Введите четное число') //введите число
if (typeof (+result) !== 'number') {
  alert('Упс, кажется, вы ошиблись') //если значение не переводится в число
} else if (isNaN(+result)) {
  alert('Ошибка, введено НЕ ЧИСЛО')  // является ли НаНом переведенное в число значение?
} else if (result % 2 === 0) {
  alert('Число четное')  //остаток от деления на 0-четное
} else {
  alert('число нечетное') } //иначе нечетное


let x= '' ;
if (typeof (x) === 'number') {
  console.log('x-число')
}
else if (typeof (x) === 'boolean') {
  console.log('x-лого')}
else if (isNaN(+x)) {
  console.log('x-НЕ число')
} else
 { console.log('неопознанная фигня')
 };
