// Дан массив. Нужно вывести в консоль количество чётных и нечётных элементов в массиве. Если в массиве есть нулевой элемент, то он учитывается и выводится отдельно. 
// При выполнении задания необходимо учесть, что массив может содержать не только числа, но и, например, знаки, null и так далее.


// В седьмом задании примерно как в первом, только побольше условий. В самом начале создайте три переменный - четные , не четные и нули.
// Всё происходит в цикле. В цикле условия на проверку четного, нечетного и нулей.
// Если это четное, то тогда +1 к переменной четных. Если не четное, то +1 к переменной нечетных. И так же с нулями

// Просто четный нечетный количество, без учета нуля и символов

let arr = [5, 10, 15, 20, 25, 30, 32, 35, 40, 45, 50];
  let sumOdd = 0;
  let sumPar = 0;
  for (let i = 0; i < arr.length; i++) {
    if (arr[i] % 2 === 0) {
      sumPar++;
    } else {
      sumOdd++;
    }
  }
  console.log("нечетный : " + sumOdd);
  console.log("четный: " + sumPar);
