// Дан массив. Нужно вывести в консоль количество чётных и нечётных элементов в массиве. Если в массиве есть нулевой элемент, то он учитывается и выводится отдельно. 
// При выполнении задания необходимо учесть, что массив может содержать не только числа, но и, например, знаки, null и так далее.


// В седьмом задании примерно как в первом, только побольше условий. В самом начале создайте три переменный - четные , не четные и нули.
// Всё происходит в цикле. В цикле условия на проверку четного, нечетного и нулей.
// Если это четное, то тогда +1 к переменной четных. Если не четное, то +1 к переменной нечетных. И так же с нулями

// Просто четный нечетный количество, без учета нуля и символов

let arr = [3, "green", 5, "ice", null, undefined, undefined, true, 6, 7];
let strSummN = 0;
let strSummI = 0;
let strSummS = 0;
let strSummB = 0;
  let sumOdd = 0;
  let sumPar = 0;

let x;
let y;



for (let i = 0; i < arr.length; i++) {
  
 x = typeof arr[i];
 y = (x == 'string')?  strSummS++ :
 (x == 'boolean')?  strSummB++:
 (x == 'number')?  strSummN++ 
 : strSummI++
if(x === 'number'){
    if (arr[i] % 2 == 0) {
      sumPar++;
    } else if  (arr[i] % 2 != 0){
      sumOdd++
    };
};};
  
 console.log("нечетный : " + sumOdd);
 console.log("четный: " + sumPar);
 console.log('количество цифр: ' + strSummN);
 console.log('количество строк: ' + strSummS);
 console.log('количество bool: ' + strSummB);
 console.log('мы не знаем что это такое, если бы знали: ' + strSummI);


